tests/trivial/report/statistics.json
{
  "GET  https://api.kraken.com/0/public/AssetPairs?pair=XX..." : {
    "transaction" : "GET  https://api.kraken.com/0/public/AssetPairs?pair=XX...",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.5,
    "medianResTime" : 145.5,
    "minResTime" : 132.0,
    "maxResTime" : 211.0,
    "pct1ResTime" : 211.0,
    "pct2ResTime" : 211.0,
    "pct3ResTime" : 211.0,
    "throughput" : 0.01780341469493849,
    "receivedKBytesPerSec" : 0.030269282210828037,
    "sentKBytesPerSec" : 0.010257826826185264
  },
  "GET  https://api.kraken.com/0/public/Ticker?pair=XBTUSD" : {
    "transaction" : "GET  https://api.kraken.com/0/public/Ticker?pair=XBTUSD",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 51.25,
    "medianResTime" : 37.0,
    "minResTime" : 30.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 101.0,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 101.0,
    "throughput" : 0.017817451302678408,
    "receivedKBytesPerSec" : 0.014998674827059364,
    "sentKBytesPerSec" : 0.010004916502968832
  },
  "Tc_03_Get information about the assets that are available for deposit, withdrawal, trading and staking." : {
    "transaction" : "Tc_03_Get information about the assets that are available for deposit, withdrawal, trading and staking.",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 150.75,
    "medianResTime" : 145.5,
    "minResTime" : 131.0,
    "maxResTime" : 181.0,
    "pct1ResTime" : 181.0,
    "pct2ResTime" : 181.0,
    "pct3ResTime" : 181.0,
    "throughput" : 0.017800958581619623,
    "receivedKBytesPerSec" : 0.012903087409381996,
    "sentKBytesPerSec" : 0.010308562928613705
  },
  "GET  https://api.kraken.com/0/public/Trades?pair=XBTUSD" : {
    "transaction" : "GET  https://api.kraken.com/0/public/Trades?pair=XBTUSD",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 118.0,
    "medianResTime" : 117.5,
    "minResTime" : 107.0,
    "maxResTime" : 130.0,
    "pct1ResTime" : 130.0,
    "pct2ResTime" : 130.0,
    "pct3ResTime" : 130.0,
    "throughput" : 0.01781316660209394,
    "receivedKBytesPerSec" : 1.031876383303719,
    "sentKBytesPerSec" : 0.010002510543167982
  },
  "Tc_06_Get OHLC Data" : {
    "transaction" : "Tc_06_Get OHLC Data",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 177.25,
    "medianResTime" : 174.0,
    "minResTime" : 163.0,
    "maxResTime" : 198.0,
    "pct1ResTime" : 198.0,
    "pct2ResTime" : 198.0,
    "pct3ResTime" : 198.0,
    "throughput" : 0.017809756184437836,
    "receivedKBytesPerSec" : 0.9978855088692585,
    "sentKBytesPerSec" : 0.009965810833674687
  },
  "Tc_05_Get Ticker Information" : {
    "transaction" : "Tc_05_Get Ticker Information",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 51.25,
    "medianResTime" : 37.0,
    "minResTime" : 30.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 101.0,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 101.0,
    "throughput" : 0.01781753066842466,
    "receivedKBytesPerSec" : 0.014998741636896544,
    "sentKBytesPerSec" : 0.01000496106869549
  },
  "Tc_07_Get Order Book" : {
    "transaction" : "Tc_07_Get Order Book",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 118.0,
    "medianResTime" : 117.5,
    "minResTime" : 107.0,
    "maxResTime" : 130.0,
    "pct1ResTime" : 130.0,
    "pct2ResTime" : 130.0,
    "pct3ResTime" : 130.0,
    "throughput" : 0.017813087275221105,
    "receivedKBytesPerSec" : 1.0318717880777006,
    "sentKBytesPerSec" : 0.010002465999269664
  },
  "Tc_01_Get the server\\'s time" : {
    "transaction" : "Tc_01_Get the server\\'s time",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 315.0,
    "medianResTime" : 222.5,
    "minResTime" : 216.0,
    "maxResTime" : 599.0,
    "pct1ResTime" : 599.0,
    "pct2ResTime" : 599.0,
    "pct3ResTime" : 599.0,
    "throughput" : 0.01776104292844076,
    "receivedKBytesPerSec" : 0.014795087517539031,
    "sentKBytesPerSec" : 0.0068858730884677555
  },
  "Tc_02_Get the current system status" : {
    "transaction" : "Tc_02_Get the current system status",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.25,
    "medianResTime" : 157.0,
    "minResTime" : 138.0,
    "maxResTime" : 181.0,
    "pct1ResTime" : 181.0,
    "pct2ResTime" : 181.0,
    "pct3ResTime" : 181.0,
    "throughput" : 0.01780040406917237,
    "receivedKBytesPerSec" : 0.010030110496008259,
    "sentKBytesPerSec" : 0.00989104483921785
  },
  "GET  https://api.kraken.com/0/public/Time" : {
    "transaction" : "GET  https://api.kraken.com/0/public/Time",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 315.0,
    "medianResTime" : 222.5,
    "minResTime" : 216.0,
    "maxResTime" : 599.0,
    "pct1ResTime" : 599.0,
    "pct2ResTime" : 599.0,
    "pct3ResTime" : 599.0,
    "throughput" : 0.017764829191167324,
    "receivedKBytesPerSec" : 0.01479824150397044,
    "sentKBytesPerSec" : 0.00688734100477874
  },
  "Tc_04_Get tradable asset pair" : {
    "transaction" : "Tc_04_Get tradable asset pair",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.5,
    "medianResTime" : 145.5,
    "minResTime" : 132.0,
    "maxResTime" : 211.0,
    "pct1ResTime" : 211.0,
    "pct2ResTime" : 211.0,
    "pct3ResTime" : 211.0,
    "throughput" : 0.017803493935684877,
    "receivedKBytesPerSec" : 0.030269416935573605,
    "sentKBytesPerSec" : 0.010257872482474685
  },
  "GET  https://api.kraken.com/0/public/OHLC?pair=XBTUSD" : {
    "transaction" : "GET  https://api.kraken.com/0/public/OHLC?pair=XBTUSD",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 177.25,
    "medianResTime" : 174.0,
    "minResTime" : 163.0,
    "maxResTime" : 198.0,
    "pct1ResTime" : 198.0,
    "pct2ResTime" : 198.0,
    "pct3ResTime" : 198.0,
    "throughput" : 0.017809756184437836,
    "receivedKBytesPerSec" : 0.9978855088692585,
    "sentKBytesPerSec" : 0.009965810833674687
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 28,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 161.2857142857143,
    "medianResTime" : 151.0,
    "minResTime" : 30.0,
    "maxResTime" : 599.0,
    "pct1ResTime" : 220.5,
    "pct2ResTime" : 430.6999999999989,
    "pct3ResTime" : 599.0,
    "throughput" : 0.12391573729863693,
    "receivedKBytesPerSec" : 2.0998643634382193,
    "sentKBytesPerSec" : 0.06693662595149584
  },
  "GET  https://api.kraken.com/0/public/Assets?asset=XBT,E..." : {
    "transaction" : "GET  https://api.kraken.com/0/public/Assets?asset=XBT,E...",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 150.75,
    "medianResTime" : 145.5,
    "minResTime" : 131.0,
    "maxResTime" : 181.0,
    "pct1ResTime" : 181.0,
    "pct2ResTime" : 181.0,
    "pct3ResTime" : 181.0,
    "throughput" : 0.017800958581619623,
    "receivedKBytesPerSec" : 0.012903087409381996,
    "sentKBytesPerSec" : 0.010308562928613705
  },
  "GET  https://api.kraken.com/0/public/SystemStatus" : {
    "transaction" : "GET  https://api.kraken.com/0/public/SystemStatus",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.25,
    "medianResTime" : 157.0,
    "minResTime" : 138.0,
    "maxResTime" : 181.0,
    "pct1ResTime" : 181.0,
    "pct2ResTime" : 181.0,
    "pct3ResTime" : 181.0,
    "throughput" : 0.01780040406917237,
    "receivedKBytesPerSec" : 0.010030110496008259,
    "sentKBytesPerSec" : 0.00989104483921785
  }
}